#Задача 3.1)
r=float (input("Введите радиус круга (r):"))
s=3.14159*r*r
print(f"Площадь круга:", s)

#Задача 3.2)
a=float (input("Введите a:"))
b=float (input("Введите b:"))
x= -b/a
print(f"x=", x)

#Задача 3.3)
C=float(input("Введите температуру в градусах Цельсия:"))
F= 95*C+32
print(f"Температура в градусах Фарангейта:", F)

#Задача 3.4)
a=float(input("Введите первое число"))
b=float(input("Введите второе число:"))
c=float(input("Введите третье число:"))
avg=(a+b+c)/3
print(f"Среднее арифметическое:", avg)

#Задача 3.5)
a1=5+2*3-4/2
a2=(3+5)*(2+4)/2
a3=-3+6/2*4
a4=5+4*5**2+7
print(a1)
print(a2)
print(a3)
print(a4)