#Задание 8.1)
print("===Задача 8.1)===")
countries = {
    "Россия": "Москва",
    "Франция": "Париж",
    "Германия": "Берлин",
    "Италия": "Рим",
    "Япония": "Токио",
    "Южная Корея": "Сеул",
    "Великобритания": "Лондон"
}
print("а) Все страны и их столицы:")
for country, capital in countries.items():
    print(f"{country} -> {capital}")

#выводим столицу для определения страны
print("b) Столица Франции:", countries["Франция"])

print("c) Словарь в алфавитном порядке стран:")
for country in sorted(countries.keys()):
    print(f"{country} -> {countries[country]}")

#Задание 8.2)
print("===Задача 8.2)===")
points = {
    'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1,
    'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2,
    'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3,
    'Й': 4, 'Ы': 4,
    'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5,
    'Ш': 8, 'Э': 8, 'Ю': 8,
    'Ф': 10, 'Щ': 10, 'Ъ': 10
}

word = input("Введите слово:").upper()
score = 0
for letter in word:
    if letter in points:
        score += points[letter]
    else:
        print(f"Внимание: буква '{letter}' не найдена в словаре очков!")

print(f"Стоимость слова '{word}': {score} очков")

#доп задание хезе делат нада иль не
